In [8]:
import pandas as pd

data = {
    "Category": ["A", "A", "A", "B", "B", "C", "C", "C", "C"],
    "Value1": [10, 20, 15, 25, 30, 5, 7, 12, 20],
    "Value2": [100, 120, 115, 130, 140, 50, 60, 70, 90]
}

df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
  Category  Value1  Value2
0        A      10     100
1        A      20     120
2        A      15     115
3        B      25     130
4        B      30     140
5        C       5      50
6        C       7      60
7        C      12      70
8        C      20      90

In [2]:
group_var = df.groupby("Category").var()
print("\nGroupBy - Variance:")
print(group_var)

GroupBy - Variance:
             Value1      Value2
Category
A         25.000000  108.333333
B         12.500000   50.000000
C         44.666667  291.666667

In [3]:
group_mean = df.groupby("Category").mean()
print("\nGroupBy - Mean:")
print(group_mean)

GroupBy - Mean:
          Value1      Value2
Category
A           15.0  111.666667
B           27.5  135.000000
C           11.0   67.500000

In [4]:
group_median = df.groupby("Category").median()
print("\nGroupBy - Median:")
print(group_median)

GroupBy - Median:
          Value1  Value2
Category
A           15.0   115.0
B           27.5   135.0
C            9.5    65.0

In [5]:
group_max = df.groupby("Category").max()
print("\nGroupBy - Max:")
print(group_max)

GroupBy - Max:
          Value1  Value2
Category
A             20     120
B             30     140
C             20      90

In [6]:
group_min = df.groupby("Category").min()
print("\nGroupBy - Min:")
print(group_min)

GroupBy - Min:
          Value1  Value2
Category
A             10     100
B             25     130
C              5      50

In [7]:
group_count = df.groupby("Category").count()
print("\nGroupBy - Count:")
print(group_count)

GroupBy - Count:
          Value1  Value2
Category
A              3       3
B              2       2
C              4       4

In [9]:
df.groupby("Category")["Value1"].std()

Category
A    5.000000
B    3.535534
C    6.683313
Name: Value1, dtype: float64

In [10]:
df.groupby("Category")["Value1"].min()

Category
A    10
B    25
C     5
Name: Value1, dtype: int64

In [11]:
df.groupby("Category")["Value1"].max()

Category
A    20
B    30
C    20
Name: Value1, dtype: int64

In [12]:
df.groupby("Category")["Value1"].median()

Category
A    15.0
B    27.5
C     9.5
Name: Value1, dtype: float64

In [13]:
df.groupby("Category")["Value1"].var()

Category
A    25.000000
B    12.500000
C    44.666667
Name: Value1, dtype: float64

In [14]:
df.groupby("Category")["Value1"].count()

Category
A    3
B    2
C    4
Name: Value1, dtype: int64

In [18]:
data = {
    "Department": ["HR", "HR", "Finance", "Finance", "IT", "IT", "Sales", "Sales"],
    "Employee": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah"],
    "Salary": [50000, 52000, 60000, 58000, 75000, 77000, 65000, 68000],
    "Experience": [3, 4, 5, 6, 8, 7, 4, 5],
    "Location": ["New York", "London", "New York", "London", "Tokyo", "Tokyo", "Berlin", "Berlin"]
}

In [20]:
df = pd.DataFrame(data)
print("Original DataFrame:")
print(df)

Original DataFrame:
  Department Employee  Salary  Experience  Location
0         HR    Alice   50000           3  New York
1         HR      Bob   52000           4    London
2    Finance  Charlie   60000           5  New York
3    Finance    David   58000           6    London
4         IT      Eva   75000           8     Tokyo
5         IT    Frank   77000           7     Tokyo
6      Sales    Grace   65000           4    Berlin
7      Sales   Hannah   68000           5    Berlin

In [21]:
pivot = pd.pivot_table(df, 
                       values="Salary", 
                       index="Department", 
                       columns="Location", 
                       aggfunc="mean")

print("\nPivot Table - Average Salary by Department and Location:")
print(pivot)

Pivot Table - Average Salary by Department and Location:
Location     Berlin   London  New York    Tokyo
Department
Finance         NaN  58000.0   60000.0      NaN
HR              NaN  52000.0   50000.0      NaN
IT              NaN      NaN       NaN  76000.0
Sales       66500.0      NaN       NaN      NaN

In [24]:
pivot = pd.pivot_table(df, 
                       values="Salary", 
                       index="Department", 
                       columns="Location",)

print("\nPivot Table - Average Salary by Department and Location:")
print(pivot)

Pivot Table - Average Salary by Department and Location:
Location     Berlin   London  New York    Tokyo
Department
Finance         NaN  58000.0   60000.0      NaN
HR              NaN  52000.0   50000.0      NaN
IT              NaN      NaN       NaN  76000.0
Sales       66500.0      NaN       NaN      NaN

In [25]:
import pandas as pd

data = {
    "Department": ["HR", "HR", "Finance", "Finance", "IT", "IT", "Sales", "Sales"],
    "Employee": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah"],
    "Salary": [50000, 52000, 60000, 58000, 75000, 77000, 65000, 68000],
    "Experience": [3, 4, 5, 6, 8, 7, 4, 5],
    "Location": ["New York", "London", "New York", "London", "Tokyo", "Tokyo", "Berlin", "Berlin"]
}

df = pd.DataFrame(data)
print(df)

  Department Employee  Salary  Experience  Location
0         HR    Alice   50000           3  New York
1         HR      Bob   52000           4    London
2    Finance  Charlie   60000           5  New York
3    Finance    David   58000           6    London
4         IT      Eva   75000           8     Tokyo
5         IT    Frank   77000           7     Tokyo
6      Sales    Grace   65000           4    Berlin
7      Sales   Hannah   68000           5    Berlin

In [26]:
pivot1 = pd.pivot_table(df, 
                        values="Salary", 
                        index="Department", 
                        columns="Location", 
                        aggfunc="mean")
print(pivot1)

Location     Berlin   London  New York    Tokyo
Department
Finance         NaN  58000.0   60000.0      NaN
HR              NaN  52000.0   50000.0      NaN
IT              NaN      NaN       NaN  76000.0
Sales       66500.0      NaN       NaN      NaN

In [27]:
pivot2 = pd.pivot_table(df,
                        values="Salary",
                        index="Department",
                        columns="Location",
                        aggfunc=["mean", "max", "min"])
print(pivot2)

               mean                                 max                    \
Location     Berlin   London New York    Tokyo   Berlin   London New York
Department
Finance         NaN  58000.0  60000.0      NaN      NaN  58000.0  60000.0
HR              NaN  52000.0  50000.0      NaN      NaN  52000.0  50000.0
IT              NaN      NaN      NaN  76000.0      NaN      NaN      NaN
Sales       66500.0      NaN      NaN      NaN  68000.0      NaN      NaN

                         min
Location      Tokyo   Berlin   London New York    Tokyo
Department
Finance         NaN      NaN  58000.0  60000.0      NaN
HR              NaN      NaN  52000.0  50000.0      NaN
IT          77000.0      NaN      NaN      NaN  75000.0
Sales           NaN  65000.0      NaN      NaN      NaN

In [28]:
pivot3 = pd.pivot_table(df,
                        values=["Salary", "Experience"],
                        index="Department",
                        aggfunc={"Salary": "mean", "Experience": "max"})
print(pivot3)

            Experience   Salary
Department
Finance              6  59000.0
HR                   4  51000.0
IT                   8  76000.0
Sales                5  66500.0

In [29]:
pivot4 = pd.pivot_table(df,
                        values="Employee",
                        index="Department",
                        columns="Location",
                        aggfunc="count")
print(pivot4)

Location    Berlin  London  New York  Tokyo
Department
Finance        NaN     1.0       1.0    NaN
HR             NaN     1.0       1.0    NaN
IT             NaN     NaN       NaN    2.0
Sales          2.0     NaN       NaN    NaN

In [30]:
pivot = pd.pivot_table(
    data=df,                        # DataFrame
    values=["Salary", "Experience"],# What to calculate
    index=["Department"],            # Rows
    columns=["Location"],            # Columns
    aggfunc={"Salary": "mean", "Experience": "max"},  # Different aggregations
    fill_value=0,                    # Replace NaN with 0
    margins=True,                    # Add row/column totals
    margins_name="Total",            # Rename the totals row/col
    dropna=True,                     # Drop columns where all values are NaN
    observed=False,                  # Include all categorical values (if categorical data exists)
    sort=True                        # Sort row/column labels
)

print("\nPivot Table:\n", pivot)

Pivot Table:
            Experience                               Salary                    \
Location       Berlin London New York Tokyo Total   Berlin   London New York
Department
Finance           0.0    6.0      5.0   0.0     6      0.0  58000.0  60000.0
HR                0.0    4.0      3.0   0.0     4      0.0  52000.0  50000.0
IT                0.0    0.0      0.0   8.0     8      0.0      0.0      0.0
Sales             5.0    0.0      0.0   0.0     5  66500.0      0.0      0.0
Total             5.0    6.0      5.0   8.0     8  66500.0  55000.0  55000.0


Location      Tokyo    Total
Department
Finance         0.0  59000.0
HR              0.0  51000.0
IT          76000.0  76000.0
Sales           0.0  66500.0
Total       76000.0  63125.0

In [31]:
df[df["Department"].isin(["IT","HR"])]

  Department Employee  Salary  Experience  Location
0         HR    Alice   50000           3  New York
1         HR      Bob   52000           4    London
4         IT      Eva   75000           8     Tokyo
5         IT    Frank   77000           7     Tokyo

ðŸ‘‰ Select everything except IT & HR.

In [33]:
df[~df["Department"].isin(["IT","HR"])]

  Department Employee  Salary  Experience  Location
2    Finance  Charlie   60000           5  New York
3    Finance    David   58000           6    London
6      Sales    Grace   65000           4    Berlin
7      Sales   Hannah   68000           5    Berlin

ðŸ‘‰ Select everything except IT & HR.

In [34]:
df[df[["Department", "Location"]].isin({
    "Department": ["IT", "Sales"],
    "Location": ["Tokyo", "Berlin"]
}).all(axis=1)]

  Department Employee  Salary  Experience Location
4         IT      Eva   75000           8    Tokyo
5         IT    Frank   77000           7    Tokyo
6      Sales    Grace   65000           4   Berlin
7      Sales   Hannah   68000           5   Berlin

ðŸ‘‰ Select only rows where:

Department is IT or Sales AND

Location is Tokyo or Berlin.

In [35]:
allowed = {"Finance", "Sales"}
df[df["Department"].isin(allowed)]

  Department Employee  Salary  Experience  Location
2    Finance  Charlie   60000           5  New York
3    Finance    David   58000           6    London
6      Sales    Grace   65000           4    Berlin
7      Sales   Hannah   68000           5    Berlin

ðŸ‘‰ Select only Finance and Sales rows.

In [ ]:
df[(df["Department"].isin(["IT", "Finance"])) & (df["Salary"] > 60000)]

ðŸ‘‰ Select rows where Department matches another list/Series.

In [37]:
allowed_departments = pd.Series(["HR", "Sales"])
df[df["Department"].isin(allowed_departments)]

  Department Employee  Salary  Experience  Location
0         HR    Alice   50000           3  New York
1         HR      Bob   52000           4    London
6      Sales    Grace   65000           4    Berlin
7      Sales   Hannah   68000           5    Berlin

ðŸ‘‰ Select rows where Department matches another list/Series.

In [38]:
df[~df[["Department", "Location"]].isin({
    "Department": ["HR"],
    "Location": ["London"]
}).any(axis=1)]

  Department Employee  Salary  Experience  Location
2    Finance  Charlie   60000           5  New York
4         IT      Eva   75000           8     Tokyo
5         IT    Frank   77000           7     Tokyo
6      Sales    Grace   65000           4    Berlin
7      Sales   Hannah   68000           5    Berlin

ðŸ‘‰ Drop rows where Department is HR OR Location is London.

In [39]:
df.query("Salary > 60000 and Experience >= 5")

  Department Employee  Salary  Experience Location
4         IT      Eva   75000           8    Tokyo
5         IT    Frank   77000           7    Tokyo
7      Sales   Hannah   68000           5   Berlin

ðŸ‘‰ Salary above 60k and at least 5 years of experience.

In [40]:
df.query("Salary > 60000")

  Department Employee  Salary  Experience Location
4         IT      Eva   75000           8    Tokyo
5         IT    Frank   77000           7    Tokyo
6      Sales    Grace   65000           4   Berlin
7      Sales   Hannah   68000           5   Berlin

ðŸ‘‰ Employees earning more than 60,000.

In [42]:
df.query("Department == 'IT' or Department == 'Finance'")

  Department Employee  Salary  Experience  Location
2    Finance  Charlie   60000           5  New York
3    Finance    David   58000           6    London
4         IT      Eva   75000           8     Tokyo
5         IT    Frank   77000           7     Tokyo

ðŸ‘‰ Selects employees from IT or Finance.

In [43]:
df.query("Department in ['HR','Sales']")

  Department Employee  Salary  Experience  Location
0         HR    Alice   50000           3  New York
1         HR      Bob   52000           4    London
6      Sales    Grace   65000           4    Berlin
7      Sales   Hannah   68000           5    Berlin

ðŸ‘‰ Only HR and Sales departments.

In [44]:
df.query("Department not in ['HR','Finance']")

  Department Employee  Salary  Experience Location
4         IT      Eva   75000           8    Tokyo
5         IT    Frank   77000           7    Tokyo
6      Sales    Grace   65000           4   Berlin
7      Sales   Hannah   68000           5   Berlin

ðŸ‘‰ Excludes HR and Finance.

In [45]:
df.query("Employee == 'Alice'")

  Department Employee  Salary  Experience  Location
0         HR    Alice   50000           3  New York

ðŸ‘‰ Selects Aliceâ€™s row.

In [46]:
df.query("Department in ['IT','Sales'] and Salary > 70000")

  Department Employee  Salary  Experience Location
4         IT      Eva   75000           8    Tokyo
5         IT    Frank   77000           7    Tokyo

ðŸ‘‰ Employees from IT or Sales with Salary > 70k.

In [47]:
df.query("Salary >= 60000 and Salary <= 70000")

  Department Employee  Salary  Experience  Location
2    Finance  Charlie   60000           5  New York
6      Sales    Grace   65000           4    Berlin
7      Sales   Hannah   68000           5    Berlin

ðŸ‘‰ Salaries between 60k and 70k.

In [48]:
min_salary = 60000
df.query("Salary > @min_salary")

  Department Employee  Salary  Experience Location
4         IT      Eva   75000           8    Tokyo
5         IT    Frank   77000           7    Tokyo
6      Sales    Grace   65000           4   Berlin
7      Sales   Hannah   68000           5   Berlin

ðŸ‘‰ @variable_name lets you use Python variables inside query().

In [49]:
pd.crosstab(df["Department"], df["Location"])

Location    Berlin  London  New York  Tokyo
Department
Finance          0       1         1      0
HR               0       1         1      0
IT               0       0         0      2
Sales            2       0         0      0

ðŸ‘‰ Shows how many employees work in each Department across different Locations.

In [50]:
pd.crosstab(df["Department"], df["Location"], margins=True)

Location    Berlin  London  New York  Tokyo  All
Department
Finance          0       1         1      0    2
HR               0       1         1      0    2
IT               0       0         0      2    2
Sales            2       0         0      0    2
All              2       2         2      2    8

ðŸ‘‰ Adds a row/column called All = totals.

In [51]:
pd.crosstab([df["Department"], df["Location"]], df["Experience"])

Experience           3  4  5  6  7  8
Department Location
Finance    London    0  0  0  1  0  0
           New York  0  0  1  0  0  0
HR         London    0  1  0  0  0  0
           New York  1  0  0  0  0  0
IT         Tokyo     0  0  0  0  1  1
Sales      Berlin    0  1  1  0  0  0

ðŸ‘‰ Multi-level index: Department + Location vs Experience years.

In [52]:
df

  Department Employee  Salary  Experience  Location
0         HR    Alice   50000           3  New York
1         HR      Bob   52000           4    London
2    Finance  Charlie   60000           5  New York
3    Finance    David   58000           6    London
4         IT      Eva   75000           8     Tokyo
5         IT    Frank   77000           7     Tokyo
6      Sales    Grace   65000           4    Berlin
7      Sales   Hannah   68000           5    Berlin

In [53]:
pd.crosstab(df["Department"], df["Location"], normalize="index")

Location    Berlin  London  New York  Tokyo
Department
Finance        0.0     0.5       0.5    0.0
HR             0.0     0.5       0.5    0.0
IT             0.0     0.0       0.0    1.0
Sales          1.0     0.0       0.0    0.0

ðŸ‘‰ Percentage of employees in each location per department.

In [55]:
pd.crosstab(df["Department"], df["Location"], values=df["Salary"], aggfunc="mean")

Location     Berlin   London  New York    Tokyo
Department
Finance         NaN  58000.0   60000.0      NaN
HR              NaN  52000.0   50000.0      NaN
IT              NaN      NaN       NaN  76000.0
Sales       66500.0      NaN       NaN      NaN

ðŸ‘‰ Instead of counts, shows average salary by Department & Location.

In [56]:
salary_bins = [40000, 60000, 70000, 80000]
salary_labels = ["40k-60k", "60k-70k", "70k-80k"]

pd.crosstab(pd.cut(df["Salary"], bins=salary_bins, labels=salary_labels),
            df["Department"])

Department  Finance  HR  IT  Sales
Salary
40k-60k           2   2   0      0
60k-70k           0   0   0      2
70k-80k           0   0   2      0

ðŸ‘‰ This shows how many employees fall in each salary range per department.

In [57]:
exp_bins = [0, 3, 5, 10]
exp_labels = ["0-3 yrs", "4-5 yrs", "6-10 yrs"]

pd.crosstab(pd.cut(df["Experience"], bins=exp_bins, labels=exp_labels),
            df["Department"])

Department  Finance  HR  IT  Sales
Experience
0-3 yrs           0   1   0      0
4-5 yrs           1   1   0      2
6-10 yrs          1   0   2      0

ðŸ‘‰ This groups employees by experience range across departments

In [62]:
pd.crosstab([df["Department"],df["Location"]],df["Experience"] > 4)

Experience           False  True
Department Location
Finance    London        0      1
           New York      0      1
HR         London        1      0
           New York      1      0
IT         Tokyo         0      2
Sales      Berlin        1      1

In [63]:
data = {
    "Department": ["HR", "HR", "Finance", "Finance", "IT", "IT", "Sales", "Sales"],
    "Employee": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Hannah"],
    "Salary": [50000, 52000, 60000, 58000, 75000, 77000, 65000, 68000],
    "Experience": [3, 4, 5, 6, 8, 7, 4, 5],
    "Location": ["New York", "London", "New York", "London", "Tokyo", "Tokyo", "Berlin", "Berlin"]
}

df = pd.DataFrame(data,index = [101,102,103,104,105,106,107,108])

In [64]:
df

    Department Employee  Salary  Experience  Location
101         HR    Alice   50000           3  New York
102         HR      Bob   52000           4    London
103    Finance  Charlie   60000           5  New York
104    Finance    David   58000           6    London
105         IT      Eva   75000           8     Tokyo
106         IT    Frank   77000           7     Tokyo
107      Sales    Grace   65000           4    Berlin
108      Sales   Hannah   68000           5    Berlin

In [68]:
df.iloc[:5,:]

    Department Employee  Salary  Experience  Location
101         HR    Alice   50000           3  New York
102         HR      Bob   52000           4    London
103    Finance  Charlie   60000           5  New York
104    Finance    David   58000           6    London
105         IT      Eva   75000           8     Tokyo

In [69]:
df.iloc[0]

Department          HR
Employee         Alice
Salary           50000
Experience           3
Location      New York
Name: 101, dtype: object

In [70]:
df.iloc[[0, 3, 6]]

    Department Employee  Salary  Experience  Location
101         HR    Alice   50000           3  New York
104    Finance    David   58000           6    London
107      Sales    Grace   65000           4    Berlin

In [71]:
df.iloc[0:3]

    Department Employee  Salary  Experience  Location
101         HR    Alice   50000           3  New York
102         HR      Bob   52000           4    London
103    Finance  Charlie   60000           5  New York

In [72]:
df.iloc[[0, 2], 0:2]

    Department Employee
101         HR    Alice
103    Finance  Charlie

In [73]:
df.iloc[(df["Experience"] > 5).values, [1, 2]]

    Employee  Salary
104    David   58000
105      Eva   75000
106    Frank   77000

In [74]:
df.loc[101]

Department          HR
Employee         Alice
Salary           50000
Experience           3
Location      New York
Name: 101, dtype: object

In [75]:
df.loc[[101, 104, 107]]

    Department Employee  Salary  Experience  Location
101         HR    Alice   50000           3  New York
104    Finance    David   58000           6    London
107      Sales    Grace   65000           4    Berlin

In [76]:
df.loc[101:104]

    Department Employee  Salary  Experience  Location
101         HR    Alice   50000           3  New York
102         HR      Bob   52000           4    London
103    Finance  Charlie   60000           5  New York
104    Finance    David   58000           6    London

In [77]:
df.loc[[101, 103], ["Employee", "Salary"]]

    Employee  Salary
101    Alice   50000
103  Charlie   60000

In [78]:
df.loc[df["Salary"] > 60000, ["Employee", "Department", "Salary"]]

    Employee Department  Salary
105      Eva         IT   75000
106    Frank         IT   77000
107    Grace      Sales   65000
108   Hannah      Sales   68000